app/controllers/api/v1/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    tags = ActsAsTaggableOn::Tag.all