app/controllers/questions_controller.rb

  def index
    add_breadcrumb "Answers", answers_path

    @questions = Question.all
---
SELECT "questions".* FROM "questions"

    def set_question
      @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 57]]