app/controllers/tags_controller.rb

  def index
    tags = ActsAsTaggableOn::Tag.all
---
SELECT "tags".* FROM "tags"

  def show
    id        = params[:id].to_i
    tag       = ActsAsTaggableOn::Tag.find(id)

    taggings  = tag.taggings.select do |tagging|
      tagging.taggable_type == "Question"
    end

    questions = Question.find(
                  taggings.map(&:taggable_id)
                )
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "taggings".* FROM "taggings"  WHERE "taggings"."tag_id" = $1  [["tag_id", 4]]
SELECT "questions".* FROM "questions"  WHERE "questions"."id" IN (73, 77, 79, 82, 89, 100, 109, 111, 115, 119, 120, 125, 127, 129, 131, 133, 136)